# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
series1 = pd.Series(np.random.randint(low = 1, high = 5, size = 100))
series2 = pd.Series(np.random.randint(low = 1, high = 4, size = 100))
series3 = pd.Series(np.random.randint(low = 10000, high = 30001, size = 100))
print(series1)
print(series2)
print(series3)

0     2
1     4
2     2
3     2
4     4
     ..
95    4
96    2
97    1
98    2
99    1
Length: 100, dtype: int32
0     2
1     3
2     2
3     3
4     1
     ..
95    2
96    3
97    2
98    3
99    1
Length: 100, dtype: int32
0     22027
1     15706
2     17870
3     21548
4     20828
      ...
95    22093
96    11467
97    11709
98    12857
99    11162
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([series1, series2, series3], axis = 1)
df

    0  1      2
0   2  2  22027
1   4  3  15706
2   2  2  17870
3   2  3  21548
4   4  1  20828
.. .. ..    ...
95  4  2  22093
96  2  3  11467
97  1  2  11709
98  2  3  12857
99  1  1  11162

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
df.rename(mapper={0:'bedr', 1:'bathr', 2:'price_sqr_meter'}, axis = 1, inplace = True)
df.head()

   bedr  bathr  price_sqr_meter
0     2      2            22027
1     4      3            15706
2     2      2            17870
3     2      3            21548
4     4      1            20828

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
df_col = pd.concat([series1, series2, series3], axis = 0)
df_col = pd.DataFrame(df_col)

In [7]:
df_col

        0
0       2
1       4
2       2
3       2
4       4
..    ...
95  22093
96  11467
97  11709
98  12857
99  11162

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
#Yes

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
df = df_col.reset_index()